In [6]:
import pandas as pd

In [1]:
%load_ext sql

In [3]:
user = 'root'
password = 'root'
port = '8889'
database = 'TestDB'
connection_string = "mysql+pymysql://{user}:{password}@localhost:{port}/{database}?charset=UTF8".format(user=user, password=password, port=port, database=database)
try:
    %sql $connection_string
    print('Database connected!')
except:
    print('Unable to connect.')

Database connected!

In [3]:
# user = 'hv'
# password = '123456'
# connection_string = "mysql+pymysql://{user}:{password}@172.24.40.247:3306/salesdb?charset=UTF8".format(user=user, password=password)
# %sql $connection_string

'Connected: hv@salesdb'

In [10]:
drinks = %sql select * from drinks limit 5
drinks.DataFrame()

 * mysql+pymysql://root:***@localhost:8889/TestDB?charset=UTF8
5 rows affected.

,id,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,0,Afghanistan,0,0,0,0.0,AS
1,1,Albania,89,132,54,4.9,EU
2,2,Algeria,25,0,14,0.7,AF
3,3,Andorra,245,138,312,12.4,EU
4,4,Angola,217,57,45,5.9,AF

In [15]:
# Create drinks_2 by magic_sql
drinks_data = pd.read_csv('drinks.csv')
%sql --persist drinks_data

 * mysql+pymysql://root:***@localhost:8889/TestDB?charset=UTF8

'Persisted drinks_data'

In [20]:
%sql --append drinks_data

 * mysql+pymysql://root:***@localhost:8889/TestDB?charset=UTF8

'Persisted drinks_data'

In [22]:
%sql select COUNT(*) from drinks_data

 * mysql+pymysql://root:***@localhost:8889/TestDB?charset=UTF8
1 rows affected.

[(386,)]

In [5]:
%%sql 
select * 
from customers 
limit 5

 * mysql+pymysql://hv:***@172.24.40.247:3306/salesdb?charset=UTF8
   mysql+pymysql://root:***@localhost:3308/hr?charset=UTF8
5 rows affected.

[(1, 'Maria', 'Anders', 'Berlin', 'Germany', '030-0074321'),
 (2, 'Ana', 'Trujillo', 'México D.F.', 'Mexico', '(5) 555-4729'),
 (3, 'Antonio', 'Moreno', 'México D.F.', 'Mexico', '(5) 555-3932'),
 (4, 'Thomas', 'Hardy', 'London', 'UK', '(171) 555-7788'),
 (5, 'Christina', 'Berglund', 'Luleå', 'Sweden', '0921-12 34 65')]